In [1]:
import pandas as pd

In [2]:
df3 = pd.read_csv("Chocolate Sales2.csv")
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    6
dtype: int64

In [3]:
df3.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0

In [4]:
df3["Boxes Shipped"].mean()

np.float64(162.10110294117646)

In [5]:
#df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean(), inplace=True )
df3["Boxes Shipped"] = df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean())

In [6]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    0
dtype: int64

In [7]:
df3["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [8]:
# $5,320 -> 5320.00
# Önce formatı düzenle!
# obl->float
df3["Amount"] = df3["Amount"].astype(str).str.replace("[$,]","",regex =True).replace("","0")
df3["Amount"]

0        5320
1        7896
2        4501
3       12726
4       13685
         ...
1089     4410
1090     6559
1091      574
1092     2086
1093     5075
Name: Amount, Length: 1094, dtype: object

In [9]:
df3["Amount"] = ( pd.to_numeric(df3['Amount'],errors="coerce"))

In [10]:
df3["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [11]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           7
Boxes Shipped    0
dtype: int64

In [ ]:
#Ders 3 : df3["Amount"] = df3 ["Amount"].fillna ( df3 ["Amount"]

In [13]:
df3["Country"].mode()[0]

'Australia'